<?php
// +----------------------------------------------------------------------
// | 数组操作
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2017 
// | Data  2017年12月21日 下午5:25:26 
// | Version  1.0.0
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// | Author: 村长 <8044023@qq.com> 
// +----------------------------------------------------------------------
namespace Extend;
class Arrays{
    /**
     * 验证 传的值是否
     * @param unknown $data
     * @param unknown $key  */
    static public function regInfoNull($data,$key_arr){
        foreach ($key_arr as $v){
            if (!in_array($v,array_keys($data))){
                return array('code'=>412,"msg"=>"确少请求参数");
            }
        }
        return array("code"=>200);
    }
}